'use strict';

let path = require('path');

module.exports = {
	mode: 'development', //режим в котором будет работать webpack
	entry: './js/script.js', //файл с которого мы будем начинать.Здесь прописываеются все зависимости рекваир или импорт из нового стандарта
	output: {
		//файл выхода
		filename: 'bundle.js', // то как он будет называться
		path: __dirname + '/js', //то куда мы уего будем складывать
	},
	watch: true, //если стоит true после того как вызван будет отслеживать наш файл и в автоматическом режиме собирать проект, когда мы будем сохранять.

	devtool: 'source-map', // технология которая хранит информацию о исходниках, и расположения кода

	module: {}, // модули и их настройка
};
